{
  "app": {
    "name": "SHUVA"
  },
  "auth": {
    "email": "Email",
    "password": "Пароль",
    "login": "Войти",
    "register": "Зарегистрироваться",
    "forgotPassword": "Забыли пароль?",
    "noAccount": "Нет аккаунта?",
    "haveAccount": "Уже есть аккаунт?",
    "resetPassword": "Сброс пароля",
    "resetSubmit": "Отправить ссылку для сброса",
    "resetSuccess": "Инструкции по сбросу пароля отправлены на ваш email",
    "loginWithGoogle": "Войти с Google",
    "or": "или",
    "privacyNotice": "Используя это приложение, вы соглашаетесь с нашей",
    "privacyPolicy": "Политикой конфиденциальности",
    "errorEmptyFields": "Пожалуйста, заполните все поля",
    "errorInvalidCredentials": "Неверный email или пароль",
    "errorEmailNotConfirmed": "Email не подтвержден. Проверьте вашу почту",
    "errorPasswordLength": "Пароль должен содержать не менее 6 символов",
    "errorUserExists": "Пользователь с таким email уже существует",
    "errorGeneric": "Произошла ошибка при аутентификации",
    "errorGoogleSignIn": "Ошибка при входе через Google",
    "errorSessionSave": "Ошибка при сохранении сессии",
    "successRegistration": "Регистрация успешна",
    "successEmailConfirmation": "На ваш email отправлено письмо для подтверждения регистрации",
    "newPassword": "Новый пароль",
    "confirmPassword": "Подтвердите пароль",
    "saveNewPassword": "Сохранить новый пароль",
    "passwordsDoNotMatch": "Пароли не совпадают",
    "passwordUpdated": "Пароль успешно обновлен",
    "errorPasswordUpdate": "Ошибка при обновлении пароля",
    "setNewPassword": "Установка нового пароля",
    "noEmail": "Нет email",
    "errorConfig": "Ошибка при получении конфигурации Supabase:",
    "errorCheckAuth": "Ошибка при проверке авторизации:",
    "errorLogout": "Ошибка при выходе из аккаунта:",
    "errorInitialization": "Ошибка при инициализации: не удалось получить конфигурацию",
    "errorPasswordReset": "Ошибка при сбросе пароля:",
    "confirmationEmailSent": "На ваш email отправлено письмо для подтверждения регистрации"
  },
  "common": {
    "appName": "SHUVA",
    "loading": "Загрузка...",
    "error": "Ошибка",
    "success": "Успешно",
    "save": "Сохранить",
    "cancel": "Отмена",
    "close": "Закрыть",
    "send": "Отправить",
    "search": "Поиск",
    "settings": "Настройки",
    "profile": "Профиль",
    "logout": "Выйти"
  },
  "chat": {
    "new": "Новый чат",
    "default": "Чат {{number}}",
    "placeholder": "Введите ваш вопрос...",
    "send": "Отправить",
    "typing": "печатает...",
    "noMessages": "Нет сообщений",
    "startConversation": "Начните разговор",
    "errorSending": "Ошибка при отправке сообщения",
    "retry": "Повторить"
  },
  "welcome": {
    "message": "Чем могу вам помочь?"
  },
  "input": {
    "placeholder": "Спросите что-нибудь..."
  },
  "footer": {
    "powered": "Powered by Taiga Performance"
  },
  "profile": {
    "title": "Профиль",
    "language": "Язык",
    "russian": "Русский",
    "english": "English",
    "logout": "Выйти из аккаунта"
  },
  "privacy": {
    "title": "Политика конфиденциальности",
    "back": "Назад",
    "lastUpdated": "Последнее обновление: 24 апреля 2025 г.",
    "intro": {
      "part1": "Эта Политика конфиденциальности описывает наши правила и процедуры по сбору, использованию и раскрытию Вашей информации при использовании Сервиса, а также рассказывает о Ваших правах на конфиденциальность и о том, как закон защищает Вас.",
      "part2": "Мы используем Ваши личные данные для предоставления и улучшения Сервиса. Используя Сервис, Вы соглашаетесь на сбор и использование информации в соответствии с настоящей Политикой конфиденциальности. Эта Политика конфиденциальности была создана с помощью Генератора Политики конфиденциальности."
    },
    "interpretation": {
      "title": "Толкование и определения",
      "subtitle": "Толкование",
      "text": "Слова, начинающиеся с заглавной буквы, имеют значения, определенные в следующих условиях. Следующие определения имеют одинаковое значение независимо от того, употребляются ли они в единственном или множественном числе."
    },
    "definitions": {
      "title": "Определения",
      "intro": "Для целей настоящей Политики конфиденциальности:",
      "account": "Учетная запись означает уникальную учетную запись, созданную для Вас для доступа к нашему Сервису или его частям.",
      "affiliate": "Аффилированное лицо означает организацию, которая контролирует, контролируется или находится под общим контролем со стороной, где \"контроль\" означает владение 50% или более акций, долей участия или других ценных бумаг, дающих право голоса при выборе директоров или другого управляющего органа.",
      "application": "Приложение относится к Shuva, программному обеспечению, предоставляемому Компанией.",
      "company": "Компания (именуемая как \"Компания\", \"Мы\", \"Нас\" или \"Наш\" в настоящем Соглашении) относится к Shuva.",
      "country": "Страна относится к: России",
      "device": "Устройство означает любое устройство, которое может получить доступ к Сервису, такое как компьютер, мобильный телефон или цифровой планшет.",
      "personalData": "Личные данные - это любая информация, которая относится к идентифицированному или идентифицируемому физическому лицу.",
      "service": "Сервис относится к Приложению.",
      "serviceProvider": "Поставщик услуг означает любое физическое или юридическое лицо, которое обрабатывает данные от имени Компании. Это относится к сторонним компаниям или физическим лицам, нанятым Компанией для содействия Сервису, предоставления Сервиса от имени Компании, выполнения услуг, связанных с Сервисом, или помощи Компании в анализе того, как используется Сервис.",
      "usageData": "Данные об использовании относятся к данным, собираемым автоматически, либо генерируемым при использовании Сервиса, либо из самой инфраструктуры Сервиса (например, продолжительность посещения страницы).",
      "you": "Вы означает физическое лицо, получающее доступ или использующее Сервис, или компанию, или другое юридическое лицо, от имени которого такое физическое лицо получает доступ или использует Сервис, в зависимости от обстоятельств."
    },
    "collectingData": {
      "title": "Сбор и использование Ваших личных данных",
      "typesTitle": "Типы собираемых данных",
      "personalDataTitle": "Личные данные",
      "personalDataText": "При использовании нашего Сервиса мы можем попросить Вас предоставить нам определенную личную информацию, которая может быть использована для связи с Вами или для Вашей идентификации. Личная информация может включать, но не ограничивается следующим:",
      "personalDataItems": ["Адрес электронной почты", "Данные об использовании"],
      "usageDataTitle": "Данные об использовании",
      "usageDataText1": "Данные об использовании собираются автоматически при использовании Сервиса.",
      "usageDataText2": "Данные об использовании могут включать такую информацию, как адрес Интернет-протокола Вашего устройства (например, IP-адрес), тип браузера, версия браузера, страницы нашего Сервиса, которые Вы посещаете, время и дата Вашего посещения, время, проведенное на этих страницах, уникальные идентификаторы устройств и другие диагностические данные.",
      "usageDataText3": "Когда Вы получаете доступ к Сервису с помощью мобильного устройства, мы можем автоматически собирать определенную информацию, включая, но не ограничиваясь, тип мобильного устройства, которое Вы используете, уникальный идентификатор Вашего мобильного устройства, IP-адрес Вашего мобильного устройства, Вашу мобильную операционную систему, тип мобильного интернет-браузера, который Вы используете, уникальные идентификаторы устройств и другие диагностические данные.",
      "usageDataText4": "Мы также можем собирать информацию, которую Ваш браузер отправляет каждый раз, когда Вы посещаете наш Сервис или когда Вы получаете доступ к Сервису с помощью мобильного устройства."
    },
    "useOfData": {
      "title": "Использование Ваших личных данных",
      "intro": "Компания может использовать Личные данные для следующих целей:",
      "purposes": [
        "Для предоставления и поддержания нашего Сервиса, включая мониторинг использования нашего Сервиса.",
        "Для управления Вашей учетной записью: для управления Вашей регистрацией в качестве пользователя Сервиса. Предоставленные Вами Личные данные могут дать Вам доступ к различным функциям Сервиса, которые доступны Вам как зарегистрированному пользователю.",
        "Для выполнения договора: разработка, соблюдение и выполнение договора купли-продажи продуктов, товаров или услуг, которые Вы приобрели, или любого другого договора с Нами через Сервис.",
        "Для связи с Вами: Для связи с Вами по электронной почте, телефонным звонкам, SMS или другим эквивалентным формам электронной связи, таким как push-уведомления мобильного приложения относительно обновлений или информационных сообщений, связанных с функциями, продуктами или заключенными услугами, включая обновления безопасности, когда это необходимо или разумно для их реализации.",
        "Для предоставления Вам новостей, специальных предложений и общей информации о других товарах, услугах и событиях, которые мы предлагаем, которые аналогичны тем, которые Вы уже приобрели или о которых запрашивали, если Вы не отказались от получения такой информации.",
        "Для управления Вашими запросами: Для обслуживания и управления Вашими запросами к Нам.",
        "Для передачи бизнеса: Мы можем использовать Вашу информацию для оценки или проведения слияния, отчуждения, реструктуризации, реорганизации, роспуска или другой продажи или передачи некоторых или всех Наших активов, будь то в качестве действующего предприятия или как часть банкротства, ликвидации или аналогичного разбирательства, в котором Личные данные, хранящиеся у Нас о пользователях нашего Сервиса, находятся среди передаваемых активов.",
        "Для других целей: Мы можем использовать Вашу информацию для других целей, таких как анализ данных, выявление тенденций использования, определение эффективности наших рекламных кампаний и для оценки и улучшения нашего Сервиса, продуктов, услуг, маркетинга и Вашего опыта."
      ],
      "sharingIntro": "Мы можем делиться Вашей личной информацией в следующих ситуациях:",
      "sharingCases": [
        "С Поставщиками услуг: Мы можем делиться Вашей личной информацией с Поставщиками услуг для мониторинга и анализа использования нашего Сервиса, для связи с Вами.",
        "Для передачи бизнеса: Мы можем делиться или передавать Вашу личную информацию в связи с или во время переговоров о любом слиянии, продаже активов Компании, финансировании или приобретении всего или части Нашего бизнеса другой компанией.",
        "С Аффилированными лицами: Мы можем делиться Вашей информацией с Нашими аффилированными лицами, в этом случае мы потребуем от этих аффилированных лиц соблюдать настоящую Политику конфиденциальности. Аффилированные лица включают Нашу материнскую компанию и любые другие дочерние компании, партнеров по совместным предприятиям или другие компании, которые Мы контролируем или которые находятся под общим контролем с Нами.",
        "С бизнес-партнерами: Мы можем делиться Вашей информацией с Нашими бизнес-партнерами, чтобы предложить Вам определенные продукты, услуги или акции.",
        "С другими пользователями: когда Вы делитесь личной информацией или иным образом взаимодействуете в общедоступных областях с другими пользователями, такая информация может быть просмотрена всеми пользователями и может быть публично распространена за пределами.",
        "С Вашего согласия: Мы можем раскрывать Вашу личную информацию для любых других целей с Вашего согласия."
      ]
    },
    "retention": {
      "title": "Хранение Ваших личных данных",
      "text1": "Компания будет хранить Ваши Личные данные только в течение времени, необходимого для целей, изложенных в настоящей Политике конфиденциальности. Мы будем хранить и использовать Ваши Личные данные в той мере, в какой это необходимо для соблюдения наших юридических обязательств (например, если мы обязаны хранить ваши данные для соблюдения применимых законов), разрешения споров и обеспечения соблюдения наших юридических соглашений и политик.",
      "text2": "Компания также будет хранить Данные об использовании для целей внутреннего анализа. Данные об использовании обычно хранятся в течение более короткого периода времени, за исключением случаев, когда эти данные используются для усиления безопасности или для улучшения функциональности Нашего Сервиса, или Мы юридически обязаны хранить эти данные в течение более длительных периодов времени."
    },
    "transfer": {
      "title": "Передача Ваших личных данных",
      "text1": "Ваша информация, включая Личные данные, обрабатывается в операционных офисах Компании и в любых других местах, где находятся стороны, участвующие в обработке. Это означает, что эта информация может быть передана и храниться на компьютерах, расположенных за пределами Вашего штата, провинции, страны или другой правительственной юрисдикции, где законы о защите данных могут отличаться от законов Вашей юрисдикции.",
      "text2": "Ваше согласие с настоящей Политикой конфиденциальности, за которым следует предоставление Вами такой информации, представляет собой Ваше согласие на такую передачу.",
      "text3": "Компания предпримет все разумно необходимые шаги для обеспечения безопасного обращения с Вашими данными в соответствии с настоящей Политикой конфиденциальности, и никакая передача Ваших Личных данных не будет осуществляться в организацию или страну, если не будут обеспечены адекватные меры контроля, включая безопасность Ваших данных и другой личной информации."
    },
    "deleteData": {
      "title": "Удаление Ваших личных данных",
      "text1": "Вы имеете право удалить или запросить, чтобы Мы помогли в удалении Личных данных, которые Мы собрали о Вас.",
      "text2": "Наш Сервис может дать Вам возможность удалить определенную информацию о Вас из Сервиса.",
      "text3": "Вы можете обновлять, изменять или удалять свою информацию в любое время, войдя в свою Учетную запись, если она у вас есть, и посетив раздел настроек учетной записи, который позволяет вам управлять своей личной информацией. Вы также можете связаться с Нами, чтобы запросить доступ, исправить или удалить любую личную информацию, которую Вы предоставили Нам.",
      "text4": "Обратите внимание, однако, что Мы можем быть вынуждены сохранить определенную информацию, когда у нас есть юридическое обязательство или законное основание для этого."
    },
    "disclosure": {
      "title": "Раскрытие Ваших личных данных",
      "business": {
        "title": "Деловые операции",
        "text": "Если Компания участвует в слиянии, приобретении или продаже активов, Ваши Личные данные могут быть переданы. Мы предоставим уведомление до того, как Ваши Личные данные будут переданы и станут предметом другой Политики конфиденциальности."
      },
      "lawEnforcement": {
        "title": "Правоохранительные органы",
        "text": "При определенных обстоятельствах Компания может быть обязана раскрыть Ваши Личные данные, если это требуется по закону или в ответ на действительные запросы государственных органов (например, суда или правительственного агентства)."
      },
      "otherRequirements": {
        "title": "Другие юридические требования",
        "text": "Компания может раскрыть Ваши Личные данные, добросовестно полагая, что такое действие необходимо для:",
        "items": [
          "Соблюдения юридического обязательства",
          "Защиты и отстаивания прав или собственности Компании",
          "Предотвращения или расследования возможных правонарушений в связи с Сервисом",
          "Защиты личной безопасности Пользователей Сервиса или общественности",
          "Защиты от юридической ответственности"
        ]
      }
    },
    "security": {
      "title": "Безопасность Ваших личных данных",
      "text": "Безопасность Ваших Личных данных важна для Нас, но помните, что ни один метод передачи через Интернет или метод электронного хранения не является 100% безопасным. Хотя Мы стремимся использовать коммерчески приемлемые средства для защиты Ваших Личных данных, Мы не можем гарантировать их абсолютную безопасность."
    },
    "childrenPrivacy": {
      "title": "Конфиденциальность детей",
      "text1": "Наш Сервис не предназначен для лиц младше 13 лет. Мы сознательно не собираем личную информацию от лиц младше 13 лет. Если Вы являетесь родителем или опекуном и Вам известно, что Ваш ребенок предоставил Нам Личные данные, пожалуйста, свяжитесь с Нами. Если Нам станет известно, что Мы собрали Личные данные от лиц младше 13 лет без проверки родительского согласия, Мы предпримем шаги для удаления этой информации с Наших серверов.",
      "text2": "Если Нам необходимо полагаться на согласие как на юридическое основание для обработки Вашей информации, и Ваша страна требует согласия родителя, Мы можем потребовать согласие Вашего родителя, прежде чем Мы соберем и используем эту информацию."
    },
    "links": {
      "title": "Ссылки на другие веб-сайты",
      "text1": "Наш Сервис может содержать ссылки на другие веб-сайты, которые не управляются Нами. Если Вы нажмете на ссылку третьей стороны, Вы будете направлены на сайт этой третьей стороны. Мы настоятельно рекомендуем Вам ознакомиться с Политикой конфиденциальности каждого сайта, который Вы посещаете.",
      "text2": "Мы не контролируем и не несем ответственности за содержание, политику конфиденциальности или практику любых сторонних сайтов или услуг."
    },
    "changes": {
      "title": "Изменения в настоящей Политике конфиденциальности",
      "text1": "Мы можем время от времени обновлять нашу Политику конфиденциальности. Мы уведомим Вас о любых изменениях, разместив новую Политику конфиденциальности на этой странице.",
      "text2": "Мы сообщим Вам по электронной почте и/или заметным уведомлением на Нашем Сервисе до вступления изменений в силу и обновим дату \"Последнее обновление\" в верхней части настоящей Политики конфиденциальности.",
      "text3": "Вам рекомендуется периодически просматривать настоящую Политику конфиденциальности на предмет изменений. Изменения в настоящей Политике конфиденциальности вступают в силу, когда они размещаются на этой странице."
    },
    "contact": {
      "title": "Свяжитесь с нами",
      "text": "Если у вас есть какие-либо вопросы об этой Политике конфиденциальности, Вы можете связаться с нами:",
      "email": "По электронной почте: avroom@gmail.com"
    }
  }
}
